---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.ConnectorTolerance
source: html/d0cf1441-bb4e-dcdd-304d-e8a1c0d0d0c9.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.ConnectorTolerance Property

The connector tolerance value.

## Syntax (C#)
```csharp
public double ConnectorTolerance { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given value for dValue is not finite